In [3]:
import pandas as pd
import numpy as np

In [4]:
#Creating Series
#Series can be created from a python list, dictionary and numpy array
num_list = [1,2,3,4,5]
pd.Series(num_list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
week_days = ['Mon','Tues','Wed','Thur','Fri']

pd.Series(week_days, index=["a", "b", "c", "d", "e"])

a     Mon
b    Tues
c     Wed
d    Thur
e     Fri
dtype: object

In [6]:
# Creating the Series from dictionary 

countries_code = { 1:"United States",
                 91:"India",
                 49:"Germany",
                 86:"China",
                250:"Rwanda"}

pd.Series(countries_code)

1      United States
91             India
49           Germany
86             China
250           Rwanda
dtype: object

In [7]:
d = {1:'a', 2:'b', 3:'c', 4:'d'}
pd.Series(d)

1    a
2    b
3    c
4    d
dtype: object

In [8]:
# Creating the Series from NumPy array
# We peovide the list of indexes
# if we don't provide the indexes, the default indexes are numbers...starts from 0,1,2..

arr = np.array ([1, 2, 3, 4, 5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
pd.Series(arr, index=['a', 'b', 'c', 'd', 'e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
#Creating DataFrames
# Creating DataFrame from a dictionary

countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

pd.DataFrame(countries)

     Name  Codes
0     USA      1
1   India     91
2  German     49
3  Rwanda    250

In [11]:
#Creating a dataframe from a 2D array
#You can pass the list of the columns

array_2d = np.array ([[1,2,3],[4,5,6],[7,8,9]])
pd.DataFrame(array_2d, columns =['column 1', 'column 2', 'column 3'])

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [12]:
# Creating a dataframe from Pandas series 
# Pass the columns in a list

countries_code = { "United States": 1,
                 "India": 91,
                 "Germany": 49,
                 "China": 86,
                 "Rwanda":250}

pd_series = pd.Series (countries_code)

pd.Series(countries_code)

df = pd.DataFrame(pd_series, columns = ['Codes'])
df

               Codes
United States      1
India             91
Germany           49
China             86
Rwanda           250

In [13]:
# Adding a column
# Number in population are pretty random

df ['Population'] = [100, 450, 575, 5885, 533]

df

               Codes  Population
United States      1         100
India             91         450
Germany           49         575
China             86        5885
Rwanda           250         533

In [14]:
# Removing a column 

df.drop('Population', axis =1)

               Codes
United States      1
India             91
Germany           49
China             86
Rwanda           250

In [15]:
df.columns

Index(['Codes', 'Population'], dtype='object')

In [16]:
df.keys

<bound method NDFrame.keys of                Codes  Population
United States      1         100
India             91         450
Germany           49         575
China             86        5885
Rwanda           250         533>

In [17]:
df.index

Index(['United States', 'India', 'Germany', 'China', 'Rwanda'], dtype='object')